app/Controllers/Admin/AdminController.php

    public function doLoginAdmin()
    {
        $model = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('mot_de_passe');
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@alimentaire.com'
 LIMIT 1

    public function AdminAccueil()
    {
        if (!session()->get('is_admin')) {
            return redirect()->to('/viewLoginAdmin')->with('Error', 'Veuillez vous connecter en tant qu\'administrateur.');
        }

        $userModel = new UserModel();
        $regimeModel = new RegimeModel();
        $abonnementGoldModel = new AbonnementGoldModel();
        $userRegimeModel = new UserRegimeModel();

        $data['totalUsers'] = $userModel->countAll();
        $data['goldMembers'] = $userModel->where('is_gold', 1)->countAllResults();
        $data['activeRegimes'] = $regimeModel->countAll();

        $totalGoldRow = $abonnementGoldModel->selectSum('montant')->get()->getRow();
        $totalGoldRevenue = $totalGoldRow ? ($totalGoldRow->montant ?? 0) : 0;

        $totalRegimeRow = $userRegimeModel->selectSum('prix_total')->get()->getRow();
        $totalRegimeRevenue = $totalRegimeRow ? ($totalRegimeRow->prix_total ?? 0) : 0;

        $data['totalRevenue'] = (float)$totalGoldRevenue + (float)$totalRegimeRevenue;

        $debutMois = date('Y-m-01');
        $finMois = date('Y-m-t');

        $monthlyGoldRow = $abonnementGoldModel->selectSum('montant')
            ->where('date_paiement >=', $debutMois)
            ->where('date_paiement <=', $finMois)
            ->get()
            ->getRow();
        $monthlyGoldRevenue = $monthlyGoldRow ? ($monthlyGoldRow->montant ?? 0) : 0;

        $monthlyRegimeRow = $userRegimeModel->selectSum('prix_total')
            ->where('date_debut >=', $debutMois)
            ->where('date_debut <=', $finMois)
            ->get()
            ->getRow();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_gold` = 1
SELECT COUNT(*) AS `numrows` FROM `regimes`
SELECT SUM(`montant`) AS `montant`
FROM `abonnement_gold`
SELECT SUM(`prix_total`) AS `prix_total`
FROM `user_regime`
SELECT SUM(`montant`) AS `montant`
FROM `abonnement_gold`
WHERE `date_paiement` >= '2026-05-01'
AND `date_paiement` <= '2026-05-31'
SELECT SUM(`prix_total`) AS `prix_total`
FROM `user_regime`
WHERE `date_debut` >= '2026-05-01'
AND `date_debut` <= '2026-05-31'


        $data['monthlyRevenue'] = (float)$monthlyGoldRevenue + (float)$monthlyRegimeRevenue;

        $data['recentRegimes'] = $regimeModel->orderBy('id', 'DESC')->findAll(5);
---
SELECT *
FROM `regimes`
ORDER BY `id` DESC
 LIMIT 5

    public function adminRegimes()
    {
        if (!session()->get('is_admin')) {
            return redirect()->to('/viewLoginAdmin');
        }

        $regimeModel = new RegimeModel();
        $data['regimes'] = $regimeModel->findAll();
---
SELECT *
FROM `regimes`