app/Controllers/User/UserController.php

    public function doLogin()
    {
        $model = new UserModel();

        $recuperation_email = $this->request->getPost('email');
        $recuperation_password = $this->request->getPost('mot_de_passe');
        $requetUser = $model->where('email', $recuperation_email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'jean.dupont@gmail.com'
 LIMIT 1

    public function profil()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/');
        }
        $userModel = new UserModel();
        $santeModel = new SanteModel();
        $userObjectifModel = new UserObjectifModel();
        $userRegimeModel = new UserRegimeModel();
        $rechargeModel = new RechargePortefeuilleModel();
        $codeModel = new CodePortefeuilleModel();
        $objectifModel = new ObjectifModel();
        $regimeModel = new RegimeModel();

        $user = $userModel->find($userId);
        $sante = $santeModel->where('user_id', $userId)->orderBy('id', 'DESC')->first();

        // Récupérer les objectifs de l'utilisateur
        $userObjectifs = $userObjectifModel
            ->select('user_objectif.*, objectif.nom as objectif_nom')
            ->join('objectif', 'objectif.id = user_objectif.objectif_id')
            ->where('user_objectif.user_id', $userId)
            ->orderBy('user_objectif.date_choix', 'DESC')
            ->findAll();

        // Récupérer les régimes achetés par l'utilisateur
        $userRegimes = $userRegimeModel
            ->select('user_regime.*, regimes.nom as regime_nom, regimes.description')
            ->join('regimes', 'regimes.id = user_regime.regime_id')
            ->where('user_regime.user_id', $userId)
            ->orderBy('user_regime.date_debut', 'DESC')
            ->findAll();

        // Récupérer l'historique des recharges
        $recharges = $rechargeModel
            ->select('recharge_portefeuille.*, codes_portefeuille.code, codes_portefeuille.montant as code_montant')
            ->join('codes_portefeuille', 'codes_portefeuille.id = recharge_portefeuille.code_id')
            ->where('recharge_portefeuille.user_id', $userId)
            ->orderBy('recharge_portefeuille.date_recharge', 'DESC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `sante`
WHERE `user_id` = '1'
ORDER BY `id` DESC
 LIMIT 1
SELECT `user_objectif`.*, `objectif`.`nom` as `objectif_nom`
FROM `user_objectif`
JOIN `objectif` ON `objectif`.`id` = `user_objectif`.`objectif_id`
WHERE `user_objectif`.`user_id` = '1'
ORDER BY `user_objectif`.`date_choix` DESC
SELECT `user_regime`.*, `regimes`.`nom` as `regime_nom`, `regimes`.`description`
FROM `user_regime`
JOIN `regimes` ON `regimes`.`id` = `user_regime`.`regime_id`
WHERE `user_regime`.`user_id` = '1'
ORDER BY `user_regime`.`date_debut` DESC
SELECT `recharge_portefeuille`.*, `codes_portefeuille`.`code`, `codes_portefeuille`.`montant` as `code_montant`
FROM `recharge_portefeuille`
JOIN `codes_portefeuille` ON `codes_portefeuille`.`id` = `recharge_portefeuille`.`code_id`
WHERE `recharge_portefeuille`.`user_id` = '1'
ORDER BY `recharge_portefeuille`.`date_recharge` DESC

    public function Accueil()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/');
        }

        $userModel = new UserModel();
        $santeModel = new SanteModel();

        $user = $userModel->find($userId);
        $sante = $santeModel->where('user_id', $userId)->orderBy('id', 'DESC')->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = 26
SELECT *
FROM `sante`
WHERE `user_id` = 26
ORDER BY `id` DESC
 LIMIT 1

    public function getObjectif()
    {
        $model = new ObjectifModel();

        $data['objectifs'] = $model->findAll();
---
SELECT *
FROM `objectif`

    public function ObjectifChoisie($id)
    {
        $userId = session()->get('user_id');
        if (!$userId) return redirect()->to('/');

        $regimeModel = new RegimeModel();
        $objectifModel = new ObjectifModel();
        $regimeSportModel = new RegimeSportModel();
        $userObjModel = new UserObjectifModel();
        $userModel = new UserModel();
        $santeModel = new SanteModel();

        $userObjModel->insert([
            'user_id' => $userId,
            'objectif_id' => $id
        ]);

        $user = $userModel->find($userId);
        $sante = $santeModel->where('user_id', $userId)->orderBy('id', 'DESC')->first();

        $data['objectif'] = $objectifModel->find($id);
---
INSERT INTO `user_objectif` (`user_id`, `objectif_id`) VALUES ('1', '1')
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `sante`
WHERE `user_id` = '1'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `objectif`
WHERE `objectif`.`id` = '1'

        $regimes = $query->findAll();

        foreach ($regimes as &$regime) {
            $regime['sports'] = $regimeSportModel
                ->select('activites_sportives.*')
                ->join('activites_sportives', 'activites_sportives.id = regime_sport.sport_id')
                ->where('regime_sport.regime_id', $regime['id'])
                ->findAll();
---
SELECT `activites_sportives`.*
FROM `regime_sport`
JOIN `activites_sportives` ON `activites_sportives`.`id` = `regime_sport`.`sport_id`
WHERE `regime_sport`.`regime_id` = '1'

    public function viewPorteMonnaie()
    {
        $userId = session()->get('user_id');
        if (!$userId) return redirect()->to('/');

        $userModel = new UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function exportRegimePdf($regimeId)
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/');
        }

        // Chargement Dompdf depuis une librairie externe locale (sans Composer)
        // Dompdf n'embarque pas toujours "autoload.inc.php" : il provient du projet dompdf/utils.
        if (!class_exists('Dompdf\\Dompdf')) {
            $dompdfAutoload = APPPATH . 'ThirdParty/dompdf-utils/autoload.inc.php';
            if (is_file($dompdfAutoload)) {
                require_once $dompdfAutoload;
            }
        }

        // Dompdf est requis (composer require dompdf/dompdf) ou via app/ThirdParty/dompdf + app/ThirdParty/dompdf-utils
        if (!class_exists('Dompdf\\Dompdf')) {
            return $this->response
                ->setStatusCode(500)
                ->setBody("Export PDF indisponible : la librairie Dompdf n'est pas installée. Installez-la avec Composer (dompdf/dompdf) ou placez Dompdf dans app/ThirdParty/dompdf et l'autoloader (dompdf/utils) dans app/ThirdParty/dompdf-utils/autoload.inc.php.");
        }

        $regimeModel = new RegimeModel();
        $regimeSportModel = new RegimeSportModel();

        $regime = $regimeModel->find((int) $regimeId);
---
SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 1

            return $this->response->setStatusCode(404)->setBody('Régime introuvable.');
        }

        $sports = $regimeSportModel
            ->select('activites_sportives.*')
            ->join('activites_sportives', 'activites_sportives.id = regime_sport.sport_id')
            ->where('regime_sport.regime_id', (int) $regimeId)
            ->findAll();
---
SELECT `activites_sportives`.*
FROM `regime_sport`
JOIN `activites_sportives` ON `activites_sportives`.`id` = `regime_sport`.`sport_id`
WHERE `regime_sport`.`regime_id` = 1